
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗапланированныеТО 
	Если ВидРаботы <> Перечисления.ВидыРабот.РазоваяПоСостоянию Тогда
		Движения.ЗапланированныеТО.Записывать = Истина;
		Движение = Движения.ЗапланированныеТО.Добавить();
		Движение.Период = Дата;
		Движение.Автомобиль = Автомобиль;
		Движение.ЗапланированнаяРабота = Ссылка; 
		
		Если ВидРаботы = Перечисления.ВидыРабот.РазоваяПлановаяРабота Тогда
			Движение.ЭтоРазоваяРабота = Истина; 
		КонецЕсли;
		
		Движение.НаКакомПробеге = НаКакомПробеге;
		Движение.НаКакоеВремя = ЧерезСколькоМесяцев;
		Движение.ИнтервалКМ = ПоПробегу;
		Движение.ИнтервалВремени = ПоВремени;
    КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

