
&НаСервере
Процедура АвтомобильПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПробегАвтомобиляСрезПоследних.Автомобиль КАК Автомобиль,
		|	ПробегАвтомобиляСрезПоследних.Пробег КАК Пробег
		|ИЗ
		|	РегистрСведений.ПробегАвтомобиля.СрезПоследних(, Автомобиль = &Автомобиль) КАК ПробегАвтомобиляСрезПоследних";
	
	Запрос.УстановитьПараметр("Автомобиль", Объект.Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	ТекущийПробег = Выборка.Пробег;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	АвтомобильПриИзмененииНаСервере();
КонецПроцедуры
