

&НаКлиенте
Процедура НаДатуСозданияАвто(Команда)
	ЗаполнитьДату();	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДату()
	Если ЗначениеЗаполнено(Объект.Автомобиль) Тогда
		Объект.Дата = ОбщийМодуль.ПолучитьДатуНачалаЭксплуатации(Объект.Автомобиль);
	Иначе
		Сообщить("Заполните поле автомобиль!");
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура НастроитьФормуПоВидуРаботы()

    Элементы.Группа1.Видимость = Ложь;
    Элементы.Группа3.Видимость = Ложь;

    Если Объект.ВидРаботы = ПредопределенноеЗначение(
        "Перечисление.ВидыРабот.ПлановаяРабота") Тогда
        Элементы.Группа3.Видимость = Истина;
    ИначеЕсли Объект.ВидРаботы = ПредопределенноеЗначение(
        "Перечисление.ВидыРабот.РазоваяПлановаяРабота") Тогда
        Элементы.Группа1.Видимость = Истина;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидРаботыПриИзменении(Элемент)

    НастроитьФормуПоВидуРаботы();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

    НастроитьФормуПоВидуРаботы();

КонецПроцедуры