
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПробегАвтомобиля
	Движения.ПробегАвтомобиля.Записывать = Истина;
	Движение = Движения.ПробегАвтомобиля.Добавить();
	Движение.Период = Дата;
	Движение.Автомобиль = Автомобиль;
	Движение.Пробег = Пробег;

	// регистр СделанныеТО
	Движения.СделанныеТО.Записывать = Истина;
	Для Каждого ТекСтрокаВыполненыеРаботы Из ВыполненыеРаботы Цикл
		Движение = Движения.СделанныеТО.Добавить();
		Движение.Период = Дата;
		Движение.Автомобиль = Автомобиль;
		Движение.РегламентнаяОперация = ТекСтрокаВыполненыеРаботы.РегламентнаяОперация;
		Движение.НаПробеге = Пробег;
		Движение.Дата = Дата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
