
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Автомобиль = Константы.Автомобиль.Получить();
	ТекущийПробег = ПолучитьПробег(Автомобиль);
	ТекущаяДата = ТекущаяДата();
	ЗаполнитьТЗ();
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьПробег(Автомобиль)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПробегАвтомобиляСрезПоследних.Автомобиль КАК Автомобиль,
		|	ПробегАвтомобиляСрезПоследних.Пробег КАК Пробег
		|ИЗ
		|	РегистрСведений.ПробегАвтомобиля.СрезПоследних(, Автомобиль = &Автомобиль) КАК ПробегАвтомобиляСрезПоследних";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пробег;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьТЗ()

    ДанныеТО = ОбщийМодуль.ПолучитьДанныеТО(Автомобиль);

    ТЗ.Очистить();

    НомерСтроки = 1;

    Для Каждого Данные Из ДанныеТО Цикл

        НоваяСтрока = ТЗ.Добавить();

        НоваяСтрока.Номер = НомерСтроки;
        НоваяСтрока.РегламентнаяОперация =
            Данные.РегламентнаяОперация;
        НоваяСтрока.ЧерезКМ =
            Данные.ЧерезКМ;
        НоваяСтрока.ЧерезДни =
            Данные.ЧерезДни;

        НомерСтроки = НомерСтроки + 1;

    КонецЦикла;

КонецПроцедуры
