
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Автомобиль = Константы.Автомобиль.Получить();
	ТекущийПробег = ПолучитьПробег(Автомобиль);
	ТекущаяДата = ТекущаяДата();
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьПробег(Автомобиль)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПробегАвтомобиляСрезПоследних.Автомобиль КАК Автомобиль,
		|	ПробегАвтомобиляСрезПоследних.Пробег КАК Пробег
		|ИЗ
		|	РегистрСведений.ПробегАвтомобиля.СрезПоследних(, Автомобиль = &Автомобиль) КАК ПробегАвтомобиляСрезПоследних";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пробег;
	Иначе
		Возврат 0;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции          


