


&НаСервере
Функция ПолучитьДатуНачалаЭксплуатации(Автомобиль) Экспорт

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автомобили.ДатаНачалаЭксплуатации КАК ДатаНачалаЭксплуатации
		|ИЗ
		|	Справочник.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаНачалаЭксплуатации;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции

&НаСервере
Функция ПолучитьАктуальныйПробег(Автомобиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПробегАвтомобиляСрезПоследних.Автомобиль КАК Автомобиль,
		|	ПробегАвтомобиляСрезПоследних.Пробег КАК Пробег,
		|	ПробегАвтомобиляСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ПробегАвтомобиля.СрезПоследних(, Автомобиль = &Автомобиль) КАК ПробегАвтомобиляСрезПоследних";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Данные = Новый Структура();
	
	Если Выборка.Следующий() Тогда
		Данные.Вставить("Пробег", Выборка.Пробег);
		Данные.Вставить("НаДату", Выборка.Период);	
	Иначе
		Данные.Вставить("Пробег", 0);
		Данные.Вставить("НаДату", 0);
	КонецЕсли;
	
	Возврат Данные;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции

&НаСервере
Функция ПолучитьДанныеТО(Автомобиль) Экспорт

    Запрос = Новый Запрос;

    Запрос.Текст =
    "ВЫБРАТЬ
    |   План.НазваниеРаботы КАК РегламентнаяОперация,
    |   ЗапланированныеТО.ЭтоРазоваяРабота КАК РазоваяПлановаяРабота,
    |   ВЫБОР
    |       КОГДА ЗапланированныеТО.ЭтоРазоваяРабота
    |           ТОГДА ЗапланированныеТО.НаКакомПробеге
    |               - ЕСТЬNULL(
    |                   ПробегАвтомобиля.Пробег,
    |                   Автомобили.НачальныйПробег)
    |       ИНАЧЕ
    |           ЕСТЬNULL(
    |               СделанныеТО.НаПробеге,
    |               Автомобили.НачальныйПробег)
    |               + ЗапланированныеТО.ИнтервалКМ
    |               - ЕСТЬNULL(
    |                   ПробегАвтомобиля.Пробег,
    |                   Автомобили.НачальныйПробег)
    |   КОНЕЦ КАК ЧерезКМ,
    |
    |   ВЫБОР
    |       КОГДА ЗапланированныеТО.ЭтоРазоваяРабота
    |           ТОГДА ДОБАВИТЬКДАТЕ(
    |               Автомобили.ДатаНачалаЭксплуатации,
    |               МЕСЯЦ,
    |               План.ЧерезСколькоМесяцев)
    |       ИНАЧЕ
    |           ВЫБОР
    |               КОГДА ЗапланированныеТО.ИнтервалВремени > 0
    |                   ТОГДА ДОБАВИТЬКДАТЕ(
    |                       ЕСТЬNULL(
    |                           СделанныеТО.Период,
    |                           Автомобили.ДатаНачалаЭксплуатации),
    |                       МЕСЯЦ,
    |                       ЗапланированныеТО.ИнтервалВремени)
    |               ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
    |           КОНЕЦ
    |   КОНЕЦ КАК ДатаСледующегоВыполнения
    |
    |ИЗ
    |   РегистрСведений.ЗапланированныеТО КАК ЗапланированныеТО
    |
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |           Документ.ПланированиеРаботПоАвто КАК План
    |       ПО ЗапланированныеТО.ЗапланированнаяРабота = План.Ссылка
    |
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |           Справочник.Автомобили КАК Автомобили
    |       ПО План.Автомобиль = Автомобили.Ссылка
    |
    |       ЛЕВОЕ СОЕДИНЕНИЕ
    |           РегистрСведений.ПробегАвтомобиля.СрезПоследних(
    |               ,
    |               Автомобиль = &Автомобиль) КАК ПробегАвтомобиля
    |       ПО План.Автомобиль = ПробегАвтомобиля.Автомобиль
    |
    |       ЛЕВОЕ СОЕДИНЕНИЕ
    |           РегистрСведений.СделанныеТО.СрезПоследних(
    |               ,
    |               Автомобиль = &Автомобиль) КАК СделанныеТО
    |       ПО ЗапланированныеТО.Автомобиль = СделанныеТО.Автомобиль
    |           И ЗапланированныеТО.ЗапланированнаяРабота =
    |               СделанныеТО.Работа
    |
    |ГДЕ
    |   План.Автомобиль = &Автомобиль
    |   И (
    |       НЕ ЗапланированныеТО.ЭтоРазоваяРабота
    |       ИЛИ СделанныеТО.Работа ЕСТЬ NULL
    |   )";

    Запрос.УстановитьПараметр("Автомобиль", Автомобиль);

    РезультатЗапроса = Запрос.Выполнить();
    ДанныеТО = РезультатЗапроса.Выгрузить();

    // Добавляем колонку с количеством дней до ТО.
    ДанныеТО.Колонки.Добавить(
        "ЧерезДни",
        Новый ОписаниеТипов("Число",
            Новый КвалификаторыЧисла(10, 0)));

    ТекущаяДата = ТекущаяДата();

    Для Каждого СтрокаТО Из ДанныеТО Цикл

        ДатаТО = СтрокаТО.ДатаСледующегоВыполнения;

        Если Год(ДатаТО) = 1 Тогда
            СтрокаТО.ЧерезДни = 0;
        Иначе
            СтрокаТО.ЧерезДни =
                Цел((ДатаТО - ТекущаяДата) / 86400);
        КонецЕсли;

    КонецЦикла;

    Возврат ДанныеТО;

КонецФункции
