 
 
 &НаСервере
 Функция ПолучитьДанныеТО(Автомобиль) Экспорт
	 
	 ТаблицаТО = Новый ТаблицаЗначений;
	 
	 ТаблицаТО.Колонки.Добавить("Автомобиль");
	 ТаблицаТО.Колонки.Добавить("РегламентнаяОперация");
	 ТаблицаТО.Колонки.Добавить("ВыполненоНаПробеге");
	 ТаблицаТО.Колонки.Добавить("ОсталосьКМДоВыполнения");
	 ТаблицаТО.Колонки.Добавить("ОсталосьДнейДоТО");
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст =
	 "ВЫБРАТЬ
	 |   УстановкаРегламентовСрезПоследних.Автомобиль КАК Автомобиль,
	 |   УстановкаРегламентовСрезПоследних.РегламентнаяОперация КАК РегламентнаяОперация,
	 |   СделанныеТОСрезПоследних.НаПробеге КАК ВыполненоНаПробеге,
	 |   ЕСТЬNULL(СделанныеТОСрезПоследних.НаПробеге,
	 |       ПробегАвтомобиляСрезПоследних.Пробег)
	 |       + УстановкаРегламентовСрезПоследних.Пробег
	 |       - ЕСТЬNULL(ПробегАвтомобиляСрезПоследних.Пробег, 0)
	 |       КАК ОсталосьКМДоВыполнения,
	 |   РАЗНОСТЬДАТ(
	 |       &ТекущаяДата,
	 |       ДОБАВИТЬКДАТЕ(
	 |           ЕСТЬNULL(
	 |               СделанныеТОСрезПоследних.Период,
	 |               УстановкаРегламентовСрезПоследних.Период),
	 |           МЕСЯЦ,
	 |           УстановкаРегламентовСрезПоследних.Периодизация),
	 |       ДЕНЬ) КАК ОсталосьДнейДоТО
	 |ИЗ
	 |   РегистрСведений.УстановкаРегламентов.СрезПоследних(
	 |       , Автомобиль = &Автомобиль)
	 |       КАК УстановкаРегламентовСрезПоследних
	 |   ЛЕВОЕ СОЕДИНЕНИЕ
	 |       РегистрСведений.СделанныеТО.СрезПоследних(
	 |           , Автомобиль = &Автомобиль)
	 |       КАК СделанныеТОСрезПоследних
	 |   ПО УстановкаРегламентовСрезПоследних.Автомобиль =
	 |       СделанныеТОСрезПоследних.Автомобиль
	 |       И УстановкаРегламентовСрезПоследних.РегламентнаяОперация =
	 |       СделанныеТОСрезПоследних.РегламентнаяОперация,
	 |   РегистрСведений.ПробегАвтомобиля.СрезПоследних(
	 |       , Автомобиль = &Автомобиль)
	 |       КАК ПробегАвтомобиляСрезПоследних";
	 
	 Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	 Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 НоваяСтрока = ТаблицаТО.Добавить();
		 
		 НоваяСтрока.Автомобиль =
		 Выборка.Автомобиль;
		 
		 НоваяСтрока.РегламентнаяОперация =
		 Выборка.РегламентнаяОперация;
		 
		 НоваяСтрока.ВыполненоНаПробеге =
		 Выборка.ВыполненоНаПробеге;
		 
		 НоваяСтрока.ОсталосьКМДоВыполнения =
		 Выборка.ОсталосьКМДоВыполнения;
		 
		 НоваяСтрока.ОсталосьДнейДоТО =
		 Выборка.ОсталосьДнейДоТО;
		 
	 КонецЦикла;
	 
	 Возврат ТаблицаТО;
	 
 КонецФункции